Autodesk.Revit.DB.ElementDesignOptionFilter.DesignOptionId
The design option id.
Since:
2011

Autodesk.Revit.DB.ElementDesignOptionFilter.#ctor(Autodesk.Revit.DB.ElementId,System.Boolean)
Constructs a new instance of a filter to match elements contained within a particular design option, with the option to invert the filter and find elements not contained within a particular design option.
designOptionId:
The design option id to match.
inverted:
True if the filter should match all elements which are not contained within a particular design option.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ElementDesignOptionFilter.#ctor(Autodesk.Revit.DB.ElementId)
Constructs a new instance of a filter to match elements contained within a particular design option.
designOptionId:
The design option id to match.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ElementDesignOptionFilter
A filter used to find elements contained within a particular design option.
Remarks:
This filter is a quick filter.
Quick filters operate only on the ElementRecord, a low-memory class which has
a limited interface to read element properties. Elements which are rejected
by a quick filter will not be expanded in memory.
Since:
2011